cases/ansys_verification/VMFL001/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
  VMFL001 -- full 360 deg planar annulus, one cell thick, empty front/back.
  Ri = 0.0178 m, Ro = 0.04628 m, axial thickness = 0.005 m.
  __NR__   radial cells across the gap
  __NAZB__ azimuthal cells PER 90 deg BLOCK  (total azimuthal = 4 x __NAZB__)
  Substituted by run_vmfl001.sh; this template is never edited by a run.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0125865007051 0.0125865007051 0)   // 0
    (-0.0125865007051 0.0125865007051 0)   // 1
    (-0.0125865007051 -0.0125865007051 0)   // 2
    (0.0125865007051 -0.0125865007051 0)   // 3
    (0.0327249018333 0.0327249018333 0)   // 4
    (-0.0327249018333 0.0327249018333 0)   // 5
    (-0.0327249018333 -0.0327249018333 0)   // 6
    (0.0327249018333 -0.0327249018333 0)   // 7
    (0.0125865007051 0.0125865007051 0.005)   // 8
    (-0.0125865007051 0.0125865007051 0.005)   // 9
    (-0.0125865007051 -0.0125865007051 0.005)   // 10
    (0.0125865007051 -0.0125865007051 0.005)   // 11
    (0.0327249018333 0.0327249018333 0.005)   // 12
    (-0.0327249018333 0.0327249018333 0.005)   // 13
    (-0.0327249018333 -0.0327249018333 0.005)   // 14
    (0.0327249018333 -0.0327249018333 0.005)   // 15
);

blocks
(
    hex (0 4 5 1  8 12 13 9) (__NR__ __NAZB__ 1) simpleGrading (1 1 1)
    hex (1 5 6 2  9 13 14 10) (__NR__ __NAZB__ 1) simpleGrading (1 1 1)
    hex (2 6 7 3  10 14 15 11) (__NR__ __NAZB__ 1) simpleGrading (1 1 1)
    hex (3 7 4 0  11 15 12 8) (__NR__ __NAZB__ 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (1.08993565124e-18 0.0178 0)
    arc 4 5 (2.83383269323e-18 0.04628 0)
    arc 8 9 (1.08993565124e-18 0.0178 0.005)
    arc 12 13 (2.83383269323e-18 0.04628 0.005)
    arc 1 2 (-0.0178 2.17987130248e-18 0)
    arc 5 6 (-0.04628 5.66766538645e-18 0)
    arc 9 10 (-0.0178 2.17987130248e-18 0.005)
    arc 13 14 (-0.04628 5.66766538645e-18 0.005)
    arc 2 3 (-3.26980695372e-18 -0.0178 0)
    arc 6 7 (-8.50149807968e-18 -0.04628 0)
    arc 10 11 (-3.26980695372e-18 -0.0178 0.005)
    arc 14 15 (-8.50149807968e-18 -0.04628 0.005)
    arc 3 0 (0.0178 0 0)
    arc 7 4 (0.04628 0 0)
    arc 11 8 (0.0178 0 0.005)
    arc 15 12 (0.04628 0 0.005)
);

boundary
(
    innerWall
    {
        type wall;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 8 0)
        );
    }
    outerWall
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
