cases/ansys_verification/VMFL001/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  VMFL001.  NO residualControl: the run always reaches endTime (see
  system/controlDict).  Iterative convergence is judged by the comparator.
  The domain is closed (two walls, no inlet/outlet), so pressure needs a
  reference cell: pRefCell 0, pRefValue 0.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-11;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        U               0.7;
    }
    fields
    {
        p               0.3;
    }
}

// ************************************************************************* //
